Clash Bot Workflow Prerequisites - plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Prerequisite Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

#### Prerequisites
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ClashBot/ClashBotWorkflowPrereqs/runs/run-TY9XtuGPBYii9HYN

Waiting for the plan to start...

Terraform v1.5.6
on linux_amd64
Initializing plugins and modules...
module.lambda_bucket.data.aws_caller_identity.current: Reading...
module.lambda_bucket.data.aws_region.current: Reading...
module.lambda_bucket.data.aws_partition.current: Reading...
module.lambda_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.lambda_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_bucket.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
module.lambda_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=0948928f0870858bf04a47374e9461e99c48fdaccd7bdc61bb4f3f2515ee6cfc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dynamodb_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "type"
      + id               = (known after apply)
      + name             = "clash-bot-workflow-dev"
      + range_key        = "id"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "clash-bot-workflow-dev"
        }
      + tags_all         = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
          + "Name"        = "clash-bot-workflow-dev"
        }
      + write_capacity   = 5

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "type"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled = false
        }
    }

  # module.lambda_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "clash-bot-lambda-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.lambda_bucket.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.lambda_bucket.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.lambda_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.lambda_bucket.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "TFC_AWS_PROVIDER_AUTH"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-TY9XtuGPBYii9HYN/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 4 estimated
           $2.4336/mo +$2.4336

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*